---
kind: method
id: M:Autodesk.Revit.DB.ViewSet.#ctor
source: html/d08a3a95-b207-e6e2-aa4f-bf4c8c988e77.htm
---
# Autodesk.Revit.DB.ViewSet.#ctor Method

Initializes a new instance of the ViewSet class

## Syntax (C#)
```csharp
public ViewSet()
```